
print(321 / 12)     # 除法运算，输出26.75
print(321 // 12)    # 整除运算，输出26


print(321 ** 12)    # 求幂运算，输出1196906950228928915420617322241


# ''% 相当于字符串的函数
# print('%.1f华氏度 = %.1f摄氏度' % (f, c))   
# f'' 相当于字符串的函数，可以用来格式化输出
# print(f'{f}华氏度 = {c}摄氏度')
# print(f'{f = :.1f}, {c = :.1f}')


f = float(input('请输入华氏温度: '))
c = (f - 32) / 1.8
print('%.1f华氏度 = %.1f摄氏度' % (f, c))  # 方式1,格式化输出，保留1位小数

print(f'{f:.1f}华氏度 = {c:.1f}摄氏度')    # 方式2,格式化输出，保留1位小数
print(f'{f}华氏度 = {c}摄氏度')

print(f'{f = :.1f}, {c = :.1f}')  # 方式3,格式化输出，保留1位小数